app/controllers/notices_controller.rb

SELECT "notices".* FROM "notices"
---
  def index
    @notices = Notice.all

INSERT INTO "notices" ("title", "author", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Do or do not, there is no try"], ["author", "Yoda"], ["phone", "555-555-5555"], ["created_at", "2020-04-30 00:25:21.534232"], ["updated_at", "2020-04-30 00:25:21.534232"]]
---
  def create
    @notice = Notice.new(notice_params)

    if @notice.save

SELECT "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT $2  [["id", 103], ["LIMIT", 1]]
UPDATE "notices" SET "author" = $1, "updated_at" = $2 WHERE "notices"."id" = $3  [["author", "author here 123"], ["updated_at", "2020-04-30 03:23:55.617222"], ["id", 102]]
---
  def update
    @notice = Notice.find(params[:id])
    if @notice.update(notice_params)

SELECT "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "notices" WHERE "notices"."id" = $1  [["id", 2]]
---
  def destroy
    @notice = Notice.find(params[:id])
    @notice.destroy